Ran Plan for project: `prod` dir: `environments/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # azurerm_resource_group.this will be created
+ resource "azurerm_resource_group" "this" {
      + id       = (known after apply)
      + location = "koreacentral"
      + name     = "rg-atlantis-prod"
    }

  # module.networking.azurerm_subnet.this will be created
+ resource "azurerm_subnet" "this" {
      + address_prefixes                              = [
          + "10.20.1.0/24",
        ]
      + default_outbound_access_enabled               = true
      + id                                            = (known after apply)
      + name                                          = "subnet-app"
      + private_endpoint_network_policies             = "Disabled"
      + private_link_service_network_policies_enabled = true
      + resource_group_name                           = "rg-atlantis-prod"
      + virtual_network_name                          = "vnet-atlantis"
    }

  # module.networking.azurerm_virtual_network.this will be created
+ resource "azurerm_virtual_network" "this" {
      + address_space                  = [
          + "10.20.0.0/16",
        ]
      + dns_servers                    = (known after apply)
      + guid                           = (known after apply)
      + id                             = (known after apply)
      + location                       = "koreacentral"
      + name                           = "vnet-atlantis"
      + private_endpoint_vnet_policies = "Disabled"
      + resource_group_name            = "rg-atlantis-prod"
      + subnet                         = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://427c1073420e:4141/lock?id=Seunghwan-You%252Fatlantis_azure%252Fenvironments%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 3 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```